КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/DataProcessors/РабочееМестоМенеджераПоДоставке/РабочееМестоМенеджераПоДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b83a87b5-25b9-4a22-9a0f-5ddd24e8eeb1">
  <name>РабочееМестоМенеджераПоДоставке</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="066e8fb0-3813-4481-b4bf-edfafab4aed9">
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c09e30d-ef7d-4e10-9b7e-c3d470857e36">
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f442a653-b32b-4be9-9b5e-4a5abb206d85">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="98432b29-54a0-461b-8949-90d8b093d361">
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="280f7296-5e90-4427-8283-20b46e71e378">
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f416de4c-0e65-4c7a-ac1b-6006787f8f96">
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f9e83d06-ca35-4604-8a3b-7763e3d4f9e8">
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f05a8baa-f36f-47cf-b83c-fdc47a0c74e5">
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b983ffd7-6fee-4341-823c-bc970e783c64">
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c07693f6-6c15-46b9-8ea5-6560cf995152">
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ТипыИсполнителейЗаданийНаПеревозку/ТипыИсполнителейЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fb378302-d95b-4135-bffd-6239a0199221">
  <name>ТипыИсполнителейЗаданийНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a8905e3a-939f-4248-8255-c2c1f39d3143">
    <name>НашаТранспортнаяСлужба</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d5f011ed-9752-4da4-989a-fbf936cffbff">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаданиеНаПеревозку/ЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d371a3f9-8a6a-4f41-8820-d9a12b2d57af">
  <name>ЗаданиеНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="92c5bd39-d761-43bd-97cc-896ab99e46df">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c548e8bf-5d8a-4346-ad11-7346a15a55c4">
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2bb5d9e-b206-4bc7-bae0-62643128676c">
    <name>КурьерЭкспедитор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="581369d9-44ec-4e70-98c7-55ba3307b1e9">
    <name>ДатаВремяРейсаПланПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="185053d9-9762-4036-a99d-ce89c6afcd73">
    <name>ДатаВремяРейсаПланС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="918ed87c-0276-4e11-a450-1d4bb121e1c3">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b30444bc-b440-4396-b3ce-d70c3c684ecb">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94a8b47c-9cae-4633-adb3-391049c640d5">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed075445-26f4-452d-905d-f3e2e3ebdb25">
    <name>ЗаданиеВыполняет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa7fd4d4-d68f-4ceb-ac95-6650eaa94338">
    <name>ДатаВремяРейсаФактПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b9fe414-2272-4679-94d0-f2aad4a40f51">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63702177-349b-4d17-bf16-d6891f186bf0">
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f447f68b-e419-49e0-b86a-301f0e7980f4">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="42877410-8859-4810-b356-14180c6fd9e4">
    <name>ДатаВремяРейсаФактС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f4077b4-3d45-4d14-9d79-cb03f40f871f">
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f2c1a2e-cb86-4455-90e2-890834134774">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="fc7e7f69-66c0-4524-9af0-f84439c47b6b">
    <name>Распоряжения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="89a28c00-b22c-4a61-a9e9-df53927e4978">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d1923f33-8770-4a7e-892d-1ea3c4e90ad1">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b7d67d85-7e2c-4e0f-bebe-c31e9180e68f">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cb6ed3da-0d41-46c3-b5dd-b9fb617c075e">
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4f2eb382-0750-4b94-8d10-6be4259cccd6">
      <name>ПолучательОтправитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="15b3905e-1f40-4d8c-9f31-cde2f3907a9e">
    <name>Маршрут</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="53fe645f-571c-4df4-ade9-2ee78eb589c6">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="73f69371-efc1-411d-88e3-a54d75fca5fe">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b9b978cb-d533-4778-a7c0-4c5b981f0cf2">
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4a9b3cc0-c14f-42c9-853f-2377c4e71c15">
      <name>ДополнительнаяИнформация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="68fb98bd-34a2-44b6-bb6f-97d8ec682ff2">
      <name>Доставлено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d39b5bf7-ae63-4518-9a48-f9131061ff6a">
      <name>Адрес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f72237d5-29a8-4168-a456-39b76513b45b">
      <name>Зона</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f0e45492-af13-445e-b5d6-a94ca1031eed">
      <name>ВремяС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/DataProcessors/РабочееМестоМенеджераПоДоставке/Forms/Форма/Module.bsl
&НаСервере
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	УстановитьОформлениеСтрок();
КонецПроцедуры

Процедура УстановитьОформлениеСтрок()
	
	СтрокиРаспоряжений = Новый Массив;
	ВерхниеСтрокиДерева = РаспоряженияНаДоставку.ПолучитьЭлементы();
	Для каждого ВерхняяСтрокаДерева Из ВерхниеСтрокиДерева Цикл
		Для каждого СтрокаДерева Из ВерхняяСтрокаДерева.ПолучитьЭлементы() Цикл
			СтрокиРаспоряжений.Добавить(СтрокаДерева);
		КонецЦикла;
	КонецЦикла;
	
	Для каждого СтрокаДерева Из СтрокиРаспоряжений Цикл
		
		Если СтрокаДерева.ВидРаспоряжения = "Рекламация" Тогда
			СтрокаДерева.ОформлениеСтроки = 6;
		
		ИначеЕсли СтрокаДерева.ВидРаспоряжения = "Заказ клиента" Тогда
		
			АдресВРег = ВРег(СтрокаДерева.Адрес);
			МоскваИМО = СтрНайти(АдресВРег, "МОСКОВСКАЯ") > 0
				Или СтрНайти(АдресВРег, "МОСКВА") > 0;
		
			Если СтрокаДерева.Распоряжение.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки
				И МоскваИМО
				И СтрокаДерева.СуммаПоРаспоряжению < 5000 Тогда
				СтрокаДерева.ОформлениеСтроки = 7;
			ИначеЕсли СтрокаДерева.Распоряжение.СпособДоставки = Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки
				И Не МоскваИМО
				И СтрокаДерева.СуммаПоРаспоряжению < 10000 Тогда
				СтрокаДерева.ОформлениеСтроки = 7;
			ИначеЕсли СтрокаДерева.Распоряжение.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика
				И СтрокаДерева.СуммаПоРаспоряжению < 10000 Тогда
				СтрокаДерева.ОформлениеСтроки = 7;
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура ОД_УстановитьУсловноеОформление()
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспоряженияНаДоставку.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РаспоряженияНаДоставку.ОформлениеСтроки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 6;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ДобавленныйРеквизитФон);

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспоряженияНаДоставку.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РаспоряженияНаДоставку.ОформлениеСтроки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 7;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 255, 224));

КонецПроцедуры

&НаКлиенте
Процедура ОД_ОбновитьСпискиДоставкиПосле(Команда)
	УстановитьОформлениеСтрок();	
КонецПроцедуры

&НаСервере
&Вместо("СохранитьЗаданиеВСтроке")
Процедура ОД_СохранитьЗаданиеВСтроке(СтрокаЗадание, ПометитьНаУдаление)

	Если СтрокаЗадание = Неопределено Тогда
		СтрокаЗадание = СтрокаЗаданиеПоСтрокеПункта(ЗаданияНаПеревозкуПланируемые.НайтиПоИдентификатору(Элементы.ЗаданияНаПеревозкуПланируемые.ТекущаяСтрока));
	КонецЕсли;
	
	Если Не СтрокаЗадание.Модифицирован Тогда
		Возврат;
	КонецЕсли;
	ИДСтрокаЗадание = СтрокаЗадание.ПолучитьИдентификатор();
	НовоеЗадание = НЕ ЗначениеЗаполнено(СтрокаЗадание.Ссылка)
		Или НЕ ОбщегоНазначения.СсылкаСуществует(СтрокаЗадание.Ссылка);
	
	Если НовоеЗадание Тогда
		ДокОбъект = Документы.ЗаданиеНаПеревозку.СоздатьДокумент();
		Если ЗначениеЗаполнено(СтрокаЗадание.Ссылка) Тогда
			ДокОбъект.УстановитьСсылкуНового(СтрокаЗадание.Ссылка);
		КонецЕсли;
		ДокОбъект.Заполнить(Неопределено);
		ДокОбъект.Дата		= ТекущаяДатаСеанса();
		ДокОбъект.Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(ДокОбъект.Приоритет);
		ДокОбъект.Статус	= Перечисления.СтатусыЗаданийНаПеревозку.Формируется;
		ДокОбъект.Операция  = ВидДоставки;
	Иначе
		Попытка
			ДокОбъект = СтрокаЗадание.Ссылка.ПолучитьОбъект();
			Если ПроверитьСообщитьЗаданиеИзменено(СтрокаЗадание) Тогда
				// Ожидается что пользователь получит сообщение об ошибке и нажимет кнопку "Обновить список".
				// При обновлении списка производится запись заданий с признаком модифицированности. По этой причине
				// снимается признак модифицированности с задания которое невозможно записать.
				УстановитьМодифицированность(СтрокаЗадание, ЗаданияМодифицированы, Ложь);
				Возврат;
			КонецЕсли;
			ДокОбъект.Заблокировать();
		Исключение
			Текст = НСтр("ru = 'Не удалось заблокировать %Задание% для изменений.'");
			Текст = СтрЗаменить(Текст,"%Задание%", ДокОбъект.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ДокОбъект.Ссылка);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	ДокОбъект.ТранспортноеСредство      = СтрокаЗадание.Транспорт;
	ДокОбъект.ДатаВремяРейсаПланС       = СтрокаЗадание.ВремяС;
	ДокОбъект.ДатаВремяРейсаПланПо      = СтрокаЗадание.ВремяПо;
	ДокОбъект.ДополнительнаяИнформация  = СтрокаЗадание.ДополнительнаяИнформация;
	ДокОбъект.Перевозчик                = СтрокаЗадание.Перевозчик;
	ДокОбъект.Контрагент                = СтрокаЗадание.Контрагент;
	ДокОбъект.БанковскийСчетПеревозчика = СтрокаЗадание.БанковскийСчетПеревозчика;
	ДокОбъект.Статус                    = Перечисления.СтатусыЗаданийНаПеревозку.Формируется;
	
 	// Зинаков В. 18.08.2022 - 20.12.2025
	Если СтрокаЗадание.Транспорт <> Неопределено Тогда
		ДокОбъект.Водитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаЗадание.Транспорт, "Водитель");
	КонецЕсли;
	
	ДокОбъект.ЗаданиеВыполняет          = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТранспортныеСредства.Код КАК АвтомобильГосударственныйНомер,
	|	ТранспортныеСредства.Марка КАК АвтомобильМарка,
	|	ТранспортныеСредства.ВидПеревозки КАК ВидПеревозки,
	|	ТранспортныеСредства.Тип КАК АвтомобильТип,
	|	ТранспортныеСредства.ВместимостьВКубическихМетрах КАК АвтомобильВместимостьВКубическихМетрах,
	|	ТранспортныеСредства.ГрузоподъемностьВТоннах КАК АвтомобильГрузоподъемностьВТоннах,
	|	ТранспортныеСредства.ЛицензионнаяКарточкаВид КАК ЛицензионнаяКарточкаВид,
	|	ТранспортныеСредства.ЛицензионнаяКарточкаНомер КАК ЛицензионнаяКарточкаНомер,
	|	ТранспортныеСредства.ЛицензионнаяКарточкаРегистрационныйНомер КАК ЛицензионнаяКарточкаРегистрационныйНомер,
	|	ТранспортныеСредства.ЛицензионнаяКарточкаСерия КАК ЛицензионнаяКарточкаСерия,
	|	ТранспортныеСредства.Прицеп КАК Прицеп,
	|	ТранспортныеСредства.ГосударственныйНомерПрицепа КАК ГосударственныйНомерПрицепа
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	|ГДЕ
	|	ТранспортныеСредства.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТипыТранспортныхСредств.Наименование,
	|	ТипыТранспортныхСредств.ВместимостьВКубическихМетрах,
	|	ТипыТранспортныхСредств.ГрузоподъемностьВТоннах,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Справочник.ТипыТранспортныхСредств КАК ТипыТранспортныхСредств
	|ГДЕ
	|	ТипыТранспортныхСредств.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СтрокаЗадание.Транспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДокОбъект, Выборка);
	КонецЕсли;
	
	Если ТипЗнч(СтрокаЗадание.Склад) = Тип("Строка")
		ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаЗадание.Склад,"ЭтоГруппа") = Истина Тогда
		ДокОбъект.Склад = Склад;
	Иначе
		ДокОбъект.Склад = СтрокаЗадание.Склад;
	КонецЕсли;
	ДокОбъект.Маршрут.Очистить();
	Для Каждого ПунктЗадания Из СтрокаЗадание.ПолучитьЭлементы() Цикл
		СтрокаТЧ = ДокОбъект.Маршрут.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ПунктЗадания);
	КонецЦикла;
	
	ДокОбъект.Распоряжения.Загрузить(Объект.РаспоряженияВЗаданияхНаПеревозку.Выгрузить(Новый Структура("Ссылка",СтрокаЗадание.Ссылка)));
	
	ДокОбъект.ДополнительныеСвойства.Вставить("ТоварыКДоставке", ТоварыКДоставке.Выгрузить((Новый Структура("ЗаданиеНаПеревозку",СтрокаЗадание.Ссылка))));
	
	Если ПометитьНаУдаление Тогда
		ДокОбъект.ПометкаУдаления = Истина;
		ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Иначе
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;

	Если НовоеЗадание Тогда
		ИсторияРаботыПользователя.Добавить(ДокОбъект.Ссылка);
	КонецЕсли;
	ДокОбъект.Разблокировать();
	
	СтрокаЗадание.ПорядокВМаршруте	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.Ссылка, "Номер"), Истина, Истина);
	СтрокаЗадание.Ссылка            = ДокОбъект.Ссылка;
	СтрокаЗадание.ВерсияДанных      = ДокОбъект.ВерсияДанных;
	СтрокаЗадание.Модифицирован		= Ложь;

КонецПроцедуры

&НаСервере
&Вместо("УбратьСтрокиИзЗаданийСервер")
Процедура ОД_УбратьСтрокиИзЗаданийСервер(ИсточникНакладные, ПометитьЗаданияНаУдаление)

	УдаляемыеИзЗаданийРаспоряжения = ТаблицаОбновляемыеРаспоряжения();
	
	ПомечаемыеНаУдалениеСтрокиЗадания = Новый Массив;
	
	Для Каждого ИД Из Элементы.ЗаданияНаПеревозкуПланируемые.ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = ЗаданияНаПеревозкуПланируемые.НайтиПоИдентификатору(ИД);
		
		Если ТекущаяСтрока = Неопределено Тогда
			Продолжить; //Эту строку уже удалили при переносе родительской строки
		КонецЕсли;
		
		ИтогоВес = ИтогоВес + ТекущаяСтрока.Вес;
		ИтогоОбъем = ИтогоОбъем + ТекущаяСтрока.Объем;
		
		Если ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
			СтрокаЗадание = ТекущаяСтрока;
			Если Не ПопытатьсяЗаблокироватьПолучитьСсылкуПоСтрокеЗадания(СтрокаЗадание) Тогда
				Возврат;
			КонецЕсли;
			УстановитьМодифицированность(ТекущаяСтрока, ЗаданияМодифицированы);
			Ветка = СтрокаЗадание.ПолучитьЭлементы();
			Для Каждого СтрокаПункт Из Ветка Цикл
				
				Для Каждого СтрокаРаспоряжение Из Объект.РаспоряженияВЗаданияхНаПеревозку.НайтиСтроки(Новый Структура("КлючСвязи",СтрокаПункт.КлючСвязи)) Цикл
					СтрокаДляОбновления = УдаляемыеИзЗаданийРаспоряжения.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДляОбновления, СтрокаРаспоряжение);
					Объект.РаспоряженияВЗаданияхНаПеревозку.Удалить(СтрокаРаспоряжение);
				КонецЦикла;
				
			КонецЦикла;
			Ветка.Очистить();
			СтрокаЗадание.Вес = 0;
			СтрокаЗадание.Объем = 0;
			
			ЗаданиеИзменено = ПроверитьСообщитьЗаданиеИзменено(СтрокаЗадание);
			
			Если ПометитьЗаданияНаУдаление
				И ЗначениеЗаполнено(СтрокаЗадание.Ссылка)
				И Не ЗаданиеИзменено Тогда
				ПомечаемыеНаУдалениеСтрокиЗадания.Добавить(СтрокаЗадание);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Ссылка) Тогда
				ЗаданияНаПеревозкуПланируемые.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
			КонецЕсли;
			
			ТоварыПоЗаданию = ТоварыКДоставке.НайтиСтроки(Новый Структура("ЗаданиеНаПеревозку",СтрокаЗадание.Ссылка));
			Для Каждого СтрокаТовары Из ТоварыПоЗаданию Цикл
				ТоварыКДоставке.Удалить(СтрокаТовары);
			КонецЦикла;
			СтрокаЗадание.КоличествоРаспоряжений = 0;
			
		Иначе
			
			СтрокаПункт = ТекущаяСтрока;
			СтрокаЗадание = СтрокаПункт.ПолучитьРодителя();
			ЗаданиеИзменено = ПроверитьСообщитьЗаданиеИзменено(СтрокаЗадание);
			Если Не ПопытатьсяЗаблокироватьПолучитьСсылкуПоСтрокеЗадания(СтрокаЗадание)
				Или ЗаданиеИзменено Тогда
				Возврат;
			КонецЕсли;
			УстановитьМодифицированность(ТекущаяСтрока, ЗаданияМодифицированы);
			
			Ветка = СтрокаЗадание.ПолучитьЭлементы();
			Для Каждого СтрокаРаспоряжение Из Объект.РаспоряженияВЗаданияхНаПеревозку.НайтиСтроки(Новый Структура("КлючСвязи",СтрокаПункт.КлючСвязи)) Цикл
				СтрокаДляОбновления = УдаляемыеИзЗаданийРаспоряжения.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДляОбновления, СтрокаРаспоряжение);
				ТоварыПоРаспоряжению = ТоварыКДоставке.НайтиСтроки(Новый Структура("ЗаданиеНаПеревозку,Распоряжение,Склад",СтрокаРаспоряжение.Ссылка, СтрокаРаспоряжение.Распоряжение, СтрокаРаспоряжение.Склад));
				Для Каждого СтрокаТовары Из ТоварыПоРаспоряжению Цикл
					ТоварыКДоставке.Удалить(СтрокаТовары);
				КонецЦикла;
				Объект.РаспоряженияВЗаданияхНаПеревозку.Удалить(СтрокаРаспоряжение);
			КонецЦикла;
			
			СтрокаЗадание.Вес = СтрокаЗадание.Вес - СтрокаПункт.Вес;
			СтрокаЗадание.Объем = СтрокаЗадание.Объем - СтрокаПункт.Объем;
			
			СтрокаЗадание.КоличествоРаспоряжений = СтрокаЗадание.КоличествоРаспоряжений - СтрокаПункт.КоличествоРаспоряжений;
			
			Ветка.Удалить(СтрокаПункт);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СохранитьЗаданияНаПеревозкуСервер(ПомечаемыеНаУдалениеСтрокиЗадания);
	
	Для Каждого Стр Из ПомечаемыеНаУдалениеСтрокиЗадания Цикл
		ЗаданияНаПеревозкуПланируемые.ПолучитьЭлементы().Удалить(Стр);
	КонецЦикла;
	
	ДоставкаТоваров.ОбновитьСписокРаспоряженийНаДоставку(ЭтаФорма, УдаляемыеИзЗаданийРаспоряжения);
	
	ПеренумероватьИЗаполнитьПризнакиПереходаДатВСпискеЗаданий();
	ЗаполнитьСкладыПунктовИЗаданий();
	УстановитьДоступностьЭлементов();

	Для каждого Т Из УдаляемыеИзЗаданийРаспоряжения Цикл
		ОД_Логистика.ЗаписьВРегистреСостоянияИРеквизитыДоставки(Т.Распоряжение);
	КонецЦикла;

	ДоставкаТоваров.ОбновитьСписокРаспоряженийНаДоставку(ЭтаФорма, УдаляемыеИзЗаданийРаспоряжения);

КонецПроцедуры
